# Импорт библиотеки для работы с SQLite
import sqlite3

# Создание подключения к базе данных
conn = sqlite3.connect('properties.db')
c = conn.cursor()

# Создание таблицы в базе данных
c.execute('''CREATE TABLE IF NOT EXISTS properties
             (type TEXT, area INTEGER, city TEXT, address TEXT, price INTEGER, owner1 TEXT, owner2 TEXT)''')

# Добавление данных в таблицу
apartments_data = [
    ("квартира", 60, "Москва", "ул. Тверская, д. 10", 150000000, "Иванов Е. С.", "Зенбаум Н. В."),
    ("дом", 75, "Москва", "Ленинский проспект, д. 45", 20000000, "Петрова А. В.", "Соколов Н. И."),
    ("квартира", 85, "Москва", "ул. Арбат, д. 12", 250000000, "Смирнова О. И.", "Кузнецов А. П."),
    ("дом", 50, "Москва", "Новослободская ул., д. 24", 12000000, "Козлов Д. Ю.", "Медведева Н. С."),
    ("квартира", 70, "Москва", "ул. Профсоюзная, д. 123", 180000000, "Федорова Е. А.", "Васильева Е. П."),
    ("дом", 80, "Москва", "ул. Большая Никитская, д. 15", 22000000, "Соколова Л. П.", "Ильина М. А."),
    ("квартира", 100, "Москва", "ул. Кутузовский проспект, д. 33", 300000000, "Ильина Т. В.", "Комаров Н. Г."),
    ("дом", 65, "Москва", "ул. Маросейка, д. 9", 17000000, "Никитина Е. Г.", "Белова О. Н."),
    ("квартира", 68, "Москва", "ул. Лубянка, д. 5", 190000000, "Морозов Д. В.", "Попова Т. К."),
    ("дом", 78, "Москва", "ул. Большая Полянка, д. 7", 21000000, "Кузнецова О. С.", "Степанов А. В."),
    ("квартира", 90, "Москва", "ул. Красная Пресня, д. 14", 240000000, "Волкова И. П.", "Никитина А. С."),
    ("дом", 65, "Москва", "ул. Петровка, д. 21", 23000000, "Королев А. М.", "Жуков С. В."),
    ("квартира", 95, "Москва", "ул. Садовая-Кудринская, д. 32", 270000000, "Комарова О. В.", "Федотова О. П."),
    ("дом", 55, "Москва", "ул. Шаболовка, д. 54", 16000000, "Белова Е. Н.", "Андреев И. Г."),
    ("квартира", 80, "Москва", "ул. Вавилова, д. 1", 210000000, "Жуков И. А.", "Семенова Л. И."),
    ("дом", 72, "Москва", "ул. Пречистенка, д. 11", 19500000, "Медведева А. П.", "Королев С. А."),
    ("квартира", 100, "Москва", "ул. Остоженка, д. 3", 280000000, "Соловьева Е. М.", "Кузнецов П. С."),
    ("дом", 60, "Москва", "ул. Лесная, д. 5", 18000000, "Тимофеев И. С.", "Павлов Д. М."),
    ("квартира", 110, "Москва", "ул. Мясницкая, д. 15", 320000000, "Кудрявцева А. В.", "Федоров Н. И."),
    ("дом", 68, "Москва", "ул. Никольская, д. 22", 20000000, "Васильева Е. А.", "Морозов С. П.")
]

# Добавляем данные в таблицу по одной строке за раз
for data in apartments_data:
    c.execute('INSERT INTO properties VALUES (?, ?, ?, ?, ?, ?, ?)', data)

# Сохранение изменений и закрытие подключения
conn.commit()
conn.close()

print("Данные успешно записаны в файл properties.db")
