# Импорт библиотеки для работы с SQLite
import sqlite3

# Создание подключения к базе данных
conn = sqlite3.connect('properties.db')
c = conn.cursor()

# Создание новой таблицы в базе данных
c.execute('''CREATE TABLE IF NOT EXISTS properties_new
             (id INTEGER PRIMARY KEY AUTOINCREMENT, type TEXT, area INTEGER, city TEXT, address TEXT, price INTEGER, owner TEXT)''')

# Добавление данных в новую таблицу
new_data = [
    ("квартира", 60, "Москва", "ул. Тверская, д. 10", 150000000, "Иванов Е. С."),
    ("дом", 75, "Москва", "Ленинский проспект, д. 45", 20000000, "Петрова А. В."),
    ("квартира", 85, "Москва", "ул. Арбат, д. 12", 250000000, "Смирнова О. И."),
    ("дом", 50, "Москва", "Новослободская ул., д. 24", 12000000, "Козлов Д. Ю."),
    ("квартира", 70, "Москва", "ул. Профсоюзная, д. 123", 180000000, "Федорова Е. А."),
    ("дом", 80, "Москва", "ул. Большая Никитская, д. 15", 22000000, "Соколова Л. П."),
    ("квартира", 100, "Москва", "ул. Кутузовский проспект, д. 33", 300000000, "Ильина Т. В."),
    ("дом", 65, "Москва", "ул. Маросейка, д. 9", 17000000, "Никитина Е. Г."),
    ("квартира", 68, "Москва", "ул. Лубянка, д. 5", 190000000, "Морозов Д. В."),
    ("дом", 78, "Москва", "ул. Большая Полянка, д. 7", 21000000, "Кузнецова О. С."),
    ("квартира", 90, "Москва", "ул. Красная Пресня, д. 14", 240000000, "Волкова И. П."),
    ("дом", 65, "Москва", "ул. Петровка, д. 21", 23000000, "Королев А. М."),
    ("квартира", 95, "Москва", "ул. Садовая-Кудринская, д. 32", 270000000, "Комарова О. В."),
    ("дом", 55, "Москва", "ул. Шаболовка, д. 54", 16000000, "Белова Е. Н."),
    ("квартира", 80, "Москва", "ул. Вавилова, д. 1", 210000000, "Жуков И. А."),
    ("дом", 72, "Москва", "ул. Пречистенка, д. 11", 19500000, "Медведева А. П."),
    ("квартира", 100, "Москва", "ул. Остоженка, д. 3", 280000000, "Соловьева Е. М."),
    ("дом", 60, "Москва", "ул. Лесная, д. 5", 18000000, "Тимофеев И. С."),
    ("квартира", 110, "Москва", "ул. Мясницкая, д. 15", 320000000, "Кудрявцева А. В."),
    ("дом", 68, "Москва", "ул. Никольская, д. 22", 20000000, "Васильева Е. А.")
]

c.executemany('INSERT INTO properties_new (type, area, city, address, price, owner) VALUES (?, ?, ?, ?, ?, ?)', new_data)

# Сохранение изменений и закрытие подключения
conn.commit()
conn.close()

print("Новая таблица 'properties_new' успешно создана и заполнена данными.")
